{
  "name" : "CurvatureFlowImageFilter",
  "template_code_filename" : "ImageFilter",
  "template_test_filename" : "ImageFilter",
  "number_of_inputs" : 1,
  "output_pixel_type" : "typename itk::NumericTraits<typename InputImageType::PixelType>::RealType",
  "long" : 1,
  "doc" : "Some global documentation",
  "pixel_types" : "BasicPixelIDTypeList",
  "members" : [
    {
      "name" : "TimeStep",
      "type" : "double",
      "default" : 0.05,
      "doc" : "Time step for curvature flow",
      "briefdescriptionSet" : "",
      "detaileddescriptionSet" : "Set the timestep parameter.",
      "briefdescriptionGet" : "",
      "detaileddescriptionGet" : "Get the timestep parameter."
    },
    {
      "name" : "NumberOfIterations",
      "type" : "uint32_t",
      "default" : "5u",
      "doc" : "Number of iterations to run"
    }
  ],
  "tests" : [
    {
      "tag" : "defaults",
      "description" : "Simply run with default settings",
      "settings" : [],
      "tolerance" : "0.0001",
      "inputs" : [
        "Input/RA-Float.nrrd"
      ]
    },
    {
      "tag" : "longer",
      "description" : "Change number of iterations and timestep",
      "settings" : [
        {
          "parameter" : "TimeStep",
          "value" : 0.1
        },
        {
          "parameter" : "NumberOfIterations",
          "cxx_value" : "10u",
          "value" : "10"
        }
      ],
      "tolerance" : "0.0001",
      "inputs" : [
        "Input/RA-Float.nrrd"
      ]
    }
  ],
  "briefdescription" : "Denoise an image using curvature driven flow.",
  "detaileddescription" : "CurvatureFlowImageFilter implements a curvature driven image denoising algorithm. Iso-brightness contours in the grayscale input image are viewed as a level set. The level set is then evolved using a curvature-based speed function:\n\n \\f[ I_t = \\kappa |\\nabla I| \\f] where \\f$ \\kappa \\f$ is the curvature.\n\nThe advantage of this approach is that sharp boundaries are preserved with smoothing occurring only within a region. However, it should be noted that continuous application of this scheme will result in the eventual removal of all information as each contour shrinks to zero and disappear.\n\nNote that unlike level set segmentation algorithms, the image to be denoised is already the level set and can be set directly as the input using the SetInput() method.\n\nThis filter has two parameters: the number of update iterations to be performed and the timestep between each update.\n\nThe timestep should be \"small enough\" to ensure numerical stability. Stability is guarantee when the timestep meets the CFL (Courant-Friedrichs-Levy) condition. Broadly speaking, this condition ensures that each contour does not move more than one grid position at each timestep. In the literature, the timestep is typically user specified and have to manually tuned to the application.\n\nThis filter make use of the multi-threaded finite difference solver hierarchy. Updates are computed using a CurvatureFlowFunction object. A zero flux Neumann boundary condition when computing derivatives near the data boundary.\n\nThis filter may be streamed. To support streaming this filter produces a padded output which takes into account edge effects. The size of the padding is m_NumberOfIterations on each edge. Users of this filter should only make use of the center valid central region.\n\n\\warning This filter assumes that the input and output types have the same dimensions. This filter also requires that the output image pixels are of a floating point type. This filter works for any dimensional images.\n\nReference: \"Level Set Methods and Fast Marching Methods\", J.A. Sethian, Cambridge Press, Chapter 16, Second edition, 1999.\n\n\\see DenseFiniteDifferenceImageFilter \n\n\\see CurvatureFlowFunction \n\n\\see MinMaxCurvatureFlowImageFilter \n\n\\see BinaryMinMaxCurvatureFlowImageFilter",
  "itk_module" : "ITKCurvatureFlow",
  "itk_group" : "CurvatureFlow"
}